{"keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "TimeDistributed", "config": {"batch_input_shape": [null, 8, 28, 28, 1], "trainable": true, "name": "time_distributed_1", "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "filters": 8, "padding": "valid", "kernel_size": [4, 4], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "bias_regularizer": null, "activation": "linear"}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_2", "layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "filters": 16, "padding": "valid", "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "bias_regularizer": null, "activation": "linear"}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_3", "layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "GRU", "config": {"use_bias": true, "stateful": false, "bias_regularizer": null, "recurrent_constraint": null, "unroll": false, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "recurrent_regularizer": null, "trainable": true, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "implementation": 0, "go_backwards": false, "kernel_constraint": null, "recurrent_dropout": 0.0, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 100, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "gru_1", "kernel_regularizer": null, "activation": "tanh"}}, {"class_name": "GRU", "config": {"use_bias": true, "stateful": false, "bias_regularizer": null, "recurrent_constraint": null, "unroll": false, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "recurrent_regularizer": null, "trainable": true, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "implementation": 0, "go_backwards": false, "kernel_constraint": null, "recurrent_dropout": 0.0, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 50, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "gru_2", "kernel_regularizer": null, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_regularizer": null, "units": 1}}]}