{"config": {"input_layers": [["conv2d_1_input", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 48, 48, 1], "dtype": "float32", "name": "conv2d_1_input"}, "inbound_nodes": [], "name": "conv2d_1_input", "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "filters": 64, "batch_input_shape": [null, 48, 48, 1], "dtype": "float32", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_1_input", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "name": "conv2d_2", "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "name": "conv2d_3", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "name": "conv2d_4", "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "name": "conv2d_5", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "name": "conv2d_6", "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "name": "conv2d_7", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "name": "conv2d_8", "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "max_pooling2d_4", "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "name": "conv2d_9", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "name": "conv2d_10", "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_5", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "max_pooling2d_5", "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "dropout_5", "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 512, "trainable": true, "name": "dense_1", "kernel_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_6", "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 7, "trainable": true, "name": "dense_2", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.0.0-tf", "backend": "tensorflow", "class_name": "Model"}